--> Model Summary

Model: "model_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 225, 225, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 112, 112, 32)      128       
_________________________________________________________________
conv1_relu (ReLU)            (None, 112, 112, 32)      0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128       
_________________________________________________________________
conv_dw_1_relu (ReLU)        (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256       
_________________________________________________________________
conv_pw_1_relu (ReLU)        (None, 112, 112, 64)      0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 113, 113, 64)      0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256       
_________________________________________________________________
conv_dw_2_relu (ReLU)        (None, 56, 56, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_2_relu (ReLU)        (None, 56, 56, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_dw_3_relu (ReLU)        (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_3_relu (ReLU)        (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 57, 57, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512       
_________________________________________________________________
conv_dw_4_relu (ReLU)        (None, 28, 28, 128)       0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_4_relu (ReLU)        (None, 28, 28, 256)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_dw_5_relu (ReLU)        (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_5_relu (ReLU)        (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 29, 29, 256)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024      
_________________________________________________________________
conv_dw_6_relu (ReLU)        (None, 14, 14, 256)       0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_6_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_7_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_7_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_8_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_8_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_9_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_9_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_10_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_10_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_11_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_11_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 15, 15, 512)       0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (ReLU)       (None, 7, 7, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (ReLU)       (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (ReLU)       (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (ReLU)       (None, 7, 7, 1024)        0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 1024)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 1024)              1049600   
_________________________________________________________________
dense_16 (Dense)             (None, 1024)              1049600   
_________________________________________________________________
dense_17 (Dense)             (None, 512)               524800    
_________________________________________________________________
dense_18 (Dense)             (None, 9)                 5130      
=================================================================
Total params: 5,857,994
Trainable params: 2,629,130
Non-trainable params: 3,228,864
_________________________________________________________________



--> Training Epochs

Epoch 1/1000
25/25 [==============================] - 10s 201ms/step - loss: 2.1544 - accuracy: 0.2488 - val_loss: 2.1178 - val_accuracy: 0.2344

Epoch 00001: val_accuracy improved from -inf to 0.23438, saving model to saved/model/Facial_recogNet.h5
Epoch 2/1000
25/25 [==============================] - 3s 103ms/step - loss: 1.5978 - accuracy: 0.6780 - val_loss: 1.8895 - val_accuracy: 0.3750

Epoch 00002: val_accuracy improved from 0.23438 to 0.37500, saving model to saved/model/Facial_recogNet.h5
Epoch 3/1000
25/25 [==============================] - 3s 103ms/step - loss: 1.2600 - accuracy: 0.8527 - val_loss: 1.6881 - val_accuracy: 0.5156

Epoch 00003: val_accuracy improved from 0.37500 to 0.51562, saving model to saved/model/Facial_recogNet.h5
Epoch 4/1000
25/25 [==============================] - 3s 103ms/step - loss: 0.9453 - accuracy: 0.9214 - val_loss: 1.4090 - val_accuracy: 0.7969

Epoch 00004: val_accuracy improved from 0.51562 to 0.79688, saving model to saved/model/Facial_recogNet.h5
Epoch 5/1000
25/25 [==============================] - 3s 102ms/step - loss: 0.7476 - accuracy: 0.9404 - val_loss: 1.1279 - val_accuracy: 0.7969

Epoch 00005: val_accuracy did not improve from 0.79688
Epoch 6/1000
25/25 [==============================] - 3s 101ms/step - loss: 0.5479 - accuracy: 0.9547 - val_loss: 0.8195 - val_accuracy: 0.9062

Epoch 00006: val_accuracy improved from 0.79688 to 0.90625, saving model to saved/model/Facial_recogNet.h5
Epoch 7/1000
25/25 [==============================] - 3s 103ms/step - loss: 0.4152 - accuracy: 0.9590 - val_loss: 0.6137 - val_accuracy: 0.9375

Epoch 00007: val_accuracy improved from 0.90625 to 0.93750, saving model to saved/model/Facial_recogNet.h5
Epoch 8/1000
25/25 [==============================] - 3s 103ms/step - loss: 0.3176 - accuracy: 0.9815 - val_loss: 0.4705 - val_accuracy: 0.9688

Epoch 00008: val_accuracy improved from 0.93750 to 0.96875, saving model to saved/model/Facial_recogNet.h5
Epoch 9/1000
25/25 [==============================] - 3s 104ms/step - loss: 0.2661 - accuracy: 0.9833 - val_loss: 0.3753 - val_accuracy: 0.9844

Epoch 00009: val_accuracy improved from 0.96875 to 0.98438, saving model to saved/model/Facial_recogNet.h5
Epoch 10/1000
25/25 [==============================] - 3s 103ms/step - loss: 0.2104 - accuracy: 0.9719 - val_loss: 0.3180 - val_accuracy: 0.9531

Epoch 00010: val_accuracy did not improve from 0.98438
Epoch 11/1000
25/25 [==============================] - 3s 99ms/step - loss: 0.1764 - accuracy: 0.9865 - val_loss: 0.2670 - val_accuracy: 0.9531

Epoch 00011: val_accuracy did not improve from 0.98438
Epoch 12/1000
25/25 [==============================] - 3s 102ms/step - loss: 0.1623 - accuracy: 0.9919 - val_loss: 0.2108 - val_accuracy: 0.9688

Epoch 00012: val_accuracy did not improve from 0.98438
Epoch 13/1000
25/25 [==============================] - 3s 100ms/step - loss: 0.1312 - accuracy: 0.9900 - val_loss: 0.1813 - val_accuracy: 0.9844

Epoch 00013: val_accuracy did not improve from 0.98438
Epoch 14/1000
25/25 [==============================] - 3s 101ms/step - loss: 0.1108 - accuracy: 0.9921 - val_loss: 0.1513 - val_accuracy: 0.9844

Epoch 00014: val_accuracy did not improve from 0.98438
Epoch 15/1000
25/25 [==============================] - 3s 101ms/step - loss: 0.0904 - accuracy: 0.9938 - val_loss: 0.1240 - val_accuracy: 0.9844

Epoch 00015: val_accuracy did not improve from 0.98438
Epoch 16/1000
25/25 [==============================] - 3s 100ms/step - loss: 0.0798 - accuracy: 0.9981 - val_loss: 0.1062 - val_accuracy: 0.9844

Epoch 00016: val_accuracy did not improve from 0.98438
Epoch 17/1000
25/25 [==============================] - 3s 102ms/step - loss: 0.0739 - accuracy: 0.9964 - val_loss: 0.0918 - val_accuracy: 0.9844

Epoch 00017: val_accuracy did not improve from 0.98438
Epoch 18/1000
25/25 [==============================] - 3s 102ms/step - loss: 0.0623 - accuracy: 0.9989 - val_loss: 0.0959 - val_accuracy: 0.9844

Epoch 00018: val_accuracy did not improve from 0.98438
Epoch 19/1000
25/25 [==============================] - 3s 103ms/step - loss: 0.0577 - accuracy: 0.9980 - val_loss: 0.0896 - val_accuracy: 0.9844
Restoring model weights from the end of the best epoch.


Epoch 00019: val_accuracy did not improve from 0.98438
Epoch 00019: early stopping

Max Validation Accuracy Obtained is 98.43%
